Sergio-openfoam-adapter/prueba_porous/fluid-openfoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable false;

functions
{
   forces1
   {	
	type 		myForces;
	libs		("libMyForces.so");
	porosity 	true;
	patches 	(); //(".*all.*");
	rho 		rhoInf;
	rhoInf 		1000;
	CofR 		(0 0 0);
	writeControl   	timeStep;
	writeInterval  	1;
	log 		true;
	region		region0;
	//writeFields	true;
    }

   preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }

//#include "surfaceFieldValue"
//#include "surface"
}

// ************************************************************************* //
