Sergio-openfoam-adapter/prueba_porous/fluid-openfoam/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

net_900
{
    type            DarcyForchheimer;
    cellZone        net_900;
    d               ( 122045 62235.3 62235.3 );
    f               ( 12.0276 4.00699 4.00699 );
    coordinateSystem
    {
        type            cartesian;
        origin          ( 0 0 0 );
        coordinateRotation
        {
            type            axesRotation;
            e1              ( 1 -6.2908e-06 -5.69177e-06 );
            e2              ( 6.2908e-06 1 0 );
        }
    }
}


// ************************************************************************* //
