Sergio-openfoam-adapter/prueba_porous/fluid-openfoam/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        //type            zeroGradient;
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }
    upperwall
    {
        type            noSlip;
    }
    lowerWall
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
