Sergio-openfoam-adapter/prueba_porous/fluid-openfoam/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#include "../../system/parametersDict"

flowVelocity    ( $param_flowVelocityX 0 0 );

pressure        0;

turbulentK     $param_turbulentK;

turbulentW    $param_turbulentW;




// ************************************************************************* //
