Sergio-openfoam-adapter/prueba_porous/fluid-openfoam/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $param_turbulentW;

boundaryField
{
    "inlet"
    {
        type            fixedValue;
        value           $internalField;
    }
    "outlet"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "walls"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    upperwall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }


}

// ************************************************************************* //
