Sergio-openfoam-adapter/prueba_porous/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           ();
    locations         volumeCenters;
    
    readData
    (
       	
    );

    writeData
    (
       porousForce 
    );
  };
};


FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}

